jmeter/Sistema_IoT_Resiliente_Corrigido.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="�️ Sistema IoT - Teste de Resiliência CORRIGIDO">
      <stringProp name="TestPlan.comments">
        🛡️ SISTEMA IOT DISTRIBUÍDO - TESTE DE RESILIÊNCIA CORRIGIDO
        
        📊 Arquitetura Final:
        ✅ Instâncias A: Sensores IoT (Stateless) - TEMPERATURA e UMIDADE
        ✅ Instâncias B: Data Receivers (Stateful) - 2+ receptores com persistência
        ✅ Gateway: Proxy roteando mensagens para Data Receivers
        ✅ Tolerância a Falhas: Recuperação automática e monitoramento
        
        🧪 Cenários de Teste CORRIGIDOS:
        ✅ SERVIDOR ONLINE: 0% erros (waitResponse=true + SUCCESS assertion)
        ❌ SERVIDOR OFFLINE: 100% erros (timeout + assertion failure)
        🔄 RECUPERAÇÃO: Erros diminuem quando servidor volta
        
        🛡️ TESTE DE RESILIÊNCIA REAL! 🛡️
      </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="GATEWAY_HOST" elementType="Argument">
            <stringProp name="Argument.name">GATEWAY_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="GATEWAY_PORT" elementType="Argument">
            <stringProp name="Argument.name">GATEWAY_PORT</stringProp>
            <stringProp name="Argument.value">9090</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="🤖 Sensores IoT - Carga Distribuída">
        <intProp name="ThreadGroup.num_threads">20</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">50</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="📡 Registro Sensor IoT" enabled="true">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9090</stringProp>
          <stringProp name="data">SENSOR_REGISTER|SENSOR_${__threadNum}_${__Random(1,999)}|TEMPERATURE|Lab-DIMAP-${__threadNum}|${__time()}|${__Random(20,35)}.${__Random(0,9)}</stringProp>
          <stringProp name="timeout">3000</stringProp>
          <boolProp name="closeConnection">false</boolProp>
          <boolProp name="soLinger">false</boolProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="✅ Resposta SUCCESS Obrigatória" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1149187101">SUCCESS</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">ERRO: Sistema não respondeu com SUCCESS - pode estar offline!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="⏱️ Delay Realistic" enabled="true">
          <stringProp name="ConstantTimer.delay">100</stringProp>
        </ConstantTimer>
        <hashTree/>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="📊 Envio Dados IoT">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9090</stringProp>
          <stringProp name="data">SENSOR_DATA|SENSOR_${__threadNum}_${__Random(1,999)}|TEMPERATURE|Lab-DIMAP-${__threadNum}|${__time()}|${__Random(15,40)}.${__Random(0,9)}</stringProp>
          <stringProp name="timeout">3000</stringProp>
          <boolProp name="closeConnection">false</boolProp>
          <boolProp name="soLinger">false</boolProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="✅ Resposta SUCCESS Obrigatória" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1149187101">SUCCESS</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">ERRO: Sistema não respondeu com SUCCESS - pode estar offline!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="💧 Envio Dados Umidade">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9090</stringProp>
          <stringProp name="data">SENSOR_DATA|SENSOR_${__threadNum}_${__Random(1,999)}|HUMIDITY|Lab-DIMAP-${__threadNum}|${__time()}|${__Random(45,85)}.${__Random(0,9)}</stringProp>
          <stringProp name="timeout">3000</stringProp>
          <boolProp name="closeConnection">false</boolProp>
          <boolProp name="soLinger">false</boolProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="✅ Resposta SUCCESS Obrigatória" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1149187101">SUCCESS</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">ERRO: Sistema não respondeu com SUCCESS - pode estar offline!</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="📉 Response Times Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">jmeter/results/response_times_final.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">500</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="📈 Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">jmeter/results/summary_final.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="📊 Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">jmeter/results/aggregate_final.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="🔍 View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">jmeter/results/detailed_final.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>